performance/1-artillery_report_fork.txt
Started phase 0 (Warm up), duration: 60s @ 22:29:12(-0300) 2021-11-08
Report @ 22:29:22(-0300) 2021-11-08
Elapsed time: 10 seconds
  Scenarios launched:  49
  Scenarios completed: 49
  Requests completed:  49
  Mean response/sec: 5.02
  Response time (msec):
    min: 160
    max: 303
    median: 171
    p95: 272.5
    p99: 303
  Codes:
    200: 49

Report @ 22:29:32(-0300) 2021-11-08
Elapsed time: 20 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5.01
  Response time (msec):
    min: 161
    max: 389
    median: 171
    p95: 328
    p99: 389
  Codes:
    200: 50

Report @ 22:29:42(-0300) 2021-11-08
Elapsed time: 30 seconds
  Scenarios launched:  50
  Scenarios completed: 48
  Requests completed:  48
  Mean response/sec: 5.01
  Response time (msec):
    min: 160
    max: 438
    median: 164
    p95: 311.3
    p99: 438
  Codes:
    200: 48

Report @ 22:29:52(-0300) 2021-11-08
Elapsed time: 40 seconds
  Scenarios launched:  50
  Scenarios completed: 52
  Requests completed:  52
  Mean response/sec: 5.01
  Response time (msec):
    min: 163
    max: 1349
    median: 171
    p95: 1165.1
    p99: 1348.9
  Codes:
    200: 52

Report @ 22:30:02(-0300) 2021-11-08
Elapsed time: 50 seconds
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: 5.01
  Response time (msec):
    min: 163
    max: 630
    median: 175
    p95: 343
    p99: 630
  Codes:
    200: 50

Report @ 22:30:12(-0300) 2021-11-08
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  50
  Scenarios completed: 49
  Requests completed:  49
  Mean response/sec: 5.01
  Response time (msec):
    min: 168
    max: 379
    median: 171
    p95: 301.3
    p99: 379
  Codes:
    200: 49

Started phase 1 (Ramp up load), duration: 120s @ 22:30:12(-0300) 2021-11-08
Report @ 22:30:22(-0300) 2021-11-08
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  61
  Scenarios completed: 60
  Requests completed:  60
  Mean response/sec: 6.11
  Response time (msec):
    min: 159
    max: 366
    median: 170
    p95: 292.5
    p99: 365.4
  Codes:
    200: 60

Report @ 22:30:32(-0300) 2021-11-08
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  100
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 10.13
  Response time (msec):
    min: 158
    max: 394
    median: 163
    p95: 341.5
    p99: 389
  Codes:
    200: 100

Report @ 22:30:42(-0300) 2021-11-08
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  132
  Scenarios completed: 107
  Requests completed:  107
  Mean response/sec: 13.24
  Response time (msec):
    min: 158
    max: 2138
    median: 166
    p95: 1591.4
    p99: 2006.3
  Codes:
    200: 107

Report @ 22:30:52(-0300) 2021-11-08
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  185
  Scenarios completed: 165
  Requests completed:  165
  Mean response/sec: 18.52
  Response time (msec):
    min: 1009
    max: 2835
    median: 1946
    p95: 2498.5
    p99: 2801.6
  Codes:
    200: 165

Report @ 22:31:02(-0300) 2021-11-08
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  232
  Scenarios completed: 274
  Requests completed:  274
  Mean response/sec: 23.22
  Response time (msec):
    min: 159
    max: 2221
    median: 837.5
    p95: 1987
    p99: 2160.5
  Codes:
    200: 274

Report @ 22:31:12(-0300) 2021-11-08
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  254
  Scenarios completed: 252
  Requests completed:  252
  Mean response/sec: 25.43
  Response time (msec):
    min: 158
    max: 379
    median: 178
    p95: 238.2
    p99: 363.8
  Codes:
    200: 252

Report @ 22:31:22(-0300) 2021-11-08
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  312
  Scenarios completed: 314
  Requests completed:  314
  Mean response/sec: 31.2
  Response time (msec):
    min: 167
    max: 419
    median: 179.5
    p95: 304.8
    p99: 394
  Codes:
    200: 314

Report @ 22:31:32(-0300) 2021-11-08
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  328
  Scenarios completed: 326
  Requests completed:  326
  Mean response/sec: 32.8
  Response time (msec):
    min: 163
    max: 415
    median: 173
    p95: 291
    p99: 397.9
  Codes:
    200: 326

Report @ 22:31:42(-0300) 2021-11-08
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  380
  Scenarios completed: 383
  Requests completed:  383
  Mean response/sec: 38.04
  Response time (msec):
    min: 158
    max: 412
    median: 179
    p95: 308.7
    p99: 388
  Codes:
    200: 383

Report @ 22:31:52(-0300) 2021-11-08
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  413
  Scenarios completed: 409
  Requests completed:  409
  Mean response/sec: 41.3
  Response time (msec):
    min: 163
    max: 419
    median: 179
    p95: 297
    p99: 393.7
  Codes:
    200: 409

Report @ 22:32:02(-0300) 2021-11-08
Elapsed time: 2 minutes, 50 seconds
  Scenarios launched:  438
  Scenarios completed: 438
  Requests completed:  438
  Mean response/sec: 43.84
  Response time (msec):
    min: 164
    max: 424
    median: 178
    p95: 294.2
    p99: 393.4
  Codes:
    200: 438

Report @ 22:32:12(-0300) 2021-11-08
Elapsed time: 3 minutes, 0 seconds
  Scenarios launched:  478
  Scenarios completed: 477
  Requests completed:  477
  Mean response/sec: 47.85
  Response time (msec):
    min: 163
    max: 433
    median: 174
    p95: 303.5
    p99: 392.2
  Codes:
    200: 477

Report @ 22:32:13(-0300) 2021-11-08
Elapsed time: 3 minutes, 1 second
  Scenarios launched:  26
  Scenarios completed: 35
  Requests completed:  35
  Mean response/sec: 25.74
  Response time (msec):
    min: 164
    max: 191
    median: 172
    p95: 185
    p99: 191
  Codes:
    200: 35

All virtual users finished
Summary report @ 22:32:13(-0300) 2021-11-08
  Scenarios launched:  3638
  Scenarios completed: 3638
  Requests completed:  3638
  Mean response/sec: 20.12
  Response time (msec):
    min: 158
    max: 2835
    median: 178
    p95: 1634.2
    p99: 2240.6
  Scenario counts:
    Listar: 3638 (100%)
  Codes:
    200: 3638